# SpeckleColor2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Speckle..::..SpeckleColor2 Property
Speckle Class See Also
---
The property labeled "Color 2" from the "Speckle" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string SpeckleColor2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpeckleColor2 As String
	Get
```

Visual C++
---
```text
public:
static property String^ SpeckleColor2 {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
Speckle Class
Autodesk.Revit.DB.Visual Namespace